#+TITLE: Get Things Done
#+STARTUP: overveiw
#+STARTUP: hidestars align fold nodlcheck oddeven lognotestate
#+STARTUP: logdone
#+PROPERTY: Effort_ALL  0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#+COLUMNS: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}
#+PROPERTY: Effort_ALL 0 0:10 0:20 0:30 1:00 2:00 3:00 4:00 8:00
#+TAGS:       Study(s) Project(p) Fix(f) Check(c) 

* Tasks
  :PROPERTIES:
  :CATEGORY: TASKS
  :END:
** WiFI Driver持续学习 [1/1]
*** Power Management
    - Next Action:
      Linux MT7603 STA Legacy_PSP and Fast_PSP Driver Control Flow
      V0.3
      PS Retrieve_MT7603E

*** Green AP
    - Next Action: 
      LinuxDriver Green AP - RLT MAC
      MT7603_GreenAP_Unify_MAC

*** Wifi Repeater
    - Next Action:
      MT7603_Driver_study_Virtual_interface_and_Apcli_Repeater

*** Sigle SKU
    - Next Action:
      MT7603_MT7628_Single_SKU.pptx
      Single SKU MT76xx.pptx
      MT76XX_Single_Sku_V2_20140123.doc

*** IGMP snooping
    - Next Action:
      WIFI_IGMP_snooping_study_1023

*** Test Mode
    - Next Action:
      WifiDriverStudy_TestMode

*** WoW
    - Next Action:
      WoW_MTxxxx_Intro_20141125

*** Thermal Protection
    - Next Action:
      YF_20141216_driver_study_thermal_protection
      DRS (Date Rate Switching)
*** Smart Connection
    - Next Action:
      MT7687 - Smart Connection Introduction .pptx

*** USB
    - Next Action:
      usb_study_report_junqi_2_USB Driver Register.pdf

*** 深入了解TxRx原理
    - [ ] 深入研究代码实现细节
    - [ ] 帧聚合
    - [ ] 重点研究TX流程，特别是VLAN的支持

*** Sniffer Mode
    - Next Action: Introduction of Monitor Mode

*** WDS
    - Next Action:
      WIFI_WDS_study

** LDD3学习 [0/6]
*** ☛ TODO Chapter 06 Advanced Char Driver Operations
*** ☛ TODO Chapter 14 The Linux Device Model
*** ☛ TODO Chapter 16 Block Drivers
*** ☛ TODO Chapter 18 TTY Drivers
*** ☛ TODO CONFIG_OF device_node
** 备忘
*** 研究在指定日期发送信息给自己的脚本
** ☛ TODO 阅读FreeMind代码，理清大体框架

** 802.11ac
   http://chimera.labs.oreilly.com/books/1234000001739/index.html
   
*** MAC层

*** 11ac中的BF
*** ☛ TODO 物理层                                                         :802.11ac学习:
** emacs
*** 工作流优化
**** ☛ TODO 任务开始时，自动计时
     参考代码：
     #+BEGIN_SRC emacs-lisp
        (setq org-log-done 'time)
          (defadvice org-clock-in (after wicked activate)
       "Mark STARTED when clocked in"
       (save-excursion
         (catch 'exit
           (org-back-to-heading t)
           (if (looking-at org-outline-regexp) (goto-char (1- (match-end 0))))
           (if (looking-at (concat " +" org-todo-regexp "\\( +\\|[ \t]*$\\)"))
               (org-todo "STARTED")))))     
     #+END_SRC
**** ☛ TODO 绽放时，显示等号的字体要同比例进行绽放
** ArchLinux学习 [1/1]
*** 了解systemd工作原理
** 个人杂事
** 技术修炼
*** 读书计划 [1/3]
**** ☛ TODO Learn More Study Less
**** ☛ TODO 突破思维的障碍
**** 专注力
**** 一万小时天才理论
**** 成功者的大脑
**** Break-Throuhgh Rapid Reading
**** The Art of Learning
**** 提早六小时下班的高效工作术
*** 技术书箱
**** Digital Communication Systems
     http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-02-introduction-to-eecs-ii-digital-communication-systems-fall-2012/index.htm
**** 计算机语言的构造与解释
**** 编译原理（龙书）
** 编程语言捂热计划
*** 网络编程
*** C++
**** ☛ TODO 阅读C++ Concurrency in Action
**** 阅读C++编程的55个好习惯
**** cpluff
**** Google Fruit库研究
      https://github.com/google/fruit.git
*** Java
**** Guice库研究
      https://github.com/google/guice.git
**** Freemind工具研究
***** ☛ TODO 在Tab页中添加支持双击关闭的功能
*** Android
**** Android Adventures - Mastering Fragments
     http://www.i-programmer.info/ebooks/android-adventures-mastering-fragments.html
**** Android
     http://www.i-programmer.info/programming/android.html
*** Javascript
**** 学习"Javascript Data Structures - Stacks, Queue and Deque"
     http://www.i-programmer.info/programming/javascript/1674-javascript-data-structures-stacks-queues-and-deques.html
*** Python
**** 学习Python基本的网络编程方法
**** https://automatetheboringstuff.com/
*** 设计模式
** 个人开发需求
*** 编写一个Chrome Plugin，记录自己收藏的网址
*** Wifi Debug Program                                               :PROJECT:
**** 当前Action： 搭建应用程序的基本UI界面
**** WiFi
***** ☛ TODO 显示AP列表
***** ☛ TODO 连接AP
**** P2P
***** ☛ TODO 支持WiFi直连
**** Miracast
***** ☛ TODO 支持设备投屏操作
** 开源工具
   1. simple screen recoder
   2. Dia
   3. Childsplay
** 802.11常见帧格式深入研究
*** Beacon帧
    CHANNEL_SWITCH_ANNOUNCEMENT
*** CSA(Channel Switch Announcement
    eCSA
** ☛ TODO WireShark学习目标
*** Wireshark分析数据包 [0/9]
    - [ ] TCP/IP数据包
    - [ ] DNS
    - [ ] DHCP
    - [ ] WLAN 802.11
    - [ ] Chapter 29
    - [ ] Chapter 30
    - [ ] Chapter 31
    - [ ] Chapter 32
    - [ ] Chapter 33 (command tools)
** mac80211学习
*** ☛ TODO mac80211源码分析
    - Action: 制定研究计划
** ☛ TODO [#C] IW源码学习
   - Action: 制定研究计划
** 在发送Association Request之前禁用一些HT/VHT的速率
    http://lists.infradead.org/pipermail/hostap/2015-October/034018.html

** ☛ TODO Android WiFi Framework
    制定研究计划
*** 传统WiFi流程
*** Miracast流程
*** SoftAp流程
** ☛ TODO TCP-IP.Architecture.Design.and.Implementation.in.Linux.2008
    SCHEDULED: <2016-08-15 周一>
    - [X] 第一章
** 研究emacs源码
*** ☛ TODO org-timer源码研究
** ☛ TODO CWTS学习                                                    :Study:
CWTS学习， 内容属性简单级别
Added: [2016-08-10 周三 13:40]
** ☛ TODO CWAP学习                                                    :Study:
内容属性较难级别
Added: [2016-08-10 周三 13:40]
** ☛ TODO  CWSP学习                                               :Study:
808.11 Security相关的知识学习
Added: [2016-08-10 周三 13:40]
** ☛ TODO  吞吐量问题分析SOP学习                                  :Study:
TPUT_study
Added: [2016-08-10 周三 13:45]
** ☛ TODO demo 4k miracast                                          :Project:
    SCHEDULED: <2016-08-15 周一>
Follow 4k Miracast Demo的事情
Added: [2016-08-10 周三 13:50]
** ☛ TODO 复习CWNA内容                                                :Study:
    DEADLINE: <2016-09-02 周五> SCHEDULED: <2016-08-15 周一>
    CLOCK: [2016-08-11 周四 09:53]--[2016-08-11 周四 11:29] =>  1:36
    CLOCK: [2016-08-09 周二 10:14]--[2016-08-09 周二 11:10] =>  0:56
   :PROPERTIES:
   :Effort:   8:00
   :END:
    - [X] 第一章
    - [X] 第二章
** ☛ TODO 查看公版分支上的修改                                        :Study:
    SCHEDULED: <2016-08-15 周一>
   :PROPERTIES:
   :Effort:   8:00
   :END:
*** Next Action: 153502
*** 待深入了解的修改：
      1. 155501   add p2p VHT 80 Draft Support
** ☛ TODO 研究wpa_supplicant上的修改记录                              :Study:
    SCHEDULED: <2016-08-15 周一>
   :PROPERTIES:
   :Effort:   8:00
   :END:
     - 2015-October
** ☛ TODO hostpad学习                                                 :Study:
    SCHEDULED: <2016-08-15 周一>
    CLOCK: [2016-08-09 周二 13:56]--[2016-08-09 周二 15:51] =>  1:55
    CLOCK: [2016-08-09 周二 13:24]--[2016-08-09 周二 13:56] =>  0:32
   :PROPERTIES:
   :Effort:   8:00
   :END:
** ☛ TODO =org.el= 
   SCHEDULED: <2016-08-15 周一>
   CLOCK: [2016-08-11 周四 19:32]--[2016-08-11 周四 20:36] =>  1:04
   :PROPERTIES:
   :Effort:   8:00
   :END:
   - 406行
** ☛ TODO P2P Invitation的问题                                       :Project:
    SCHEDULED: <2016-08-15 一>
    P2P Invitation失败的问题
    TODO:
    打开wpa_supplicant日志
    测试禁用persistent group的情况。update_config=0
    Set_WirelessMode_Proc失败的原因
    Added: [2016-08-10 周三 14:00]
** ☛ TODO 整理以前的学习笔记 [3/8]
   SCHEDULED: <2016-08-15 一>
   CLOCK: [2016-08-13 六 15:11]--[2016-08-13 六 15:22] =>  0:11
   :PROPERTIES:
   :Effort:   8:00
   :END:
   - [ ] Android研究文章整理
   - [X] Android学习笔记
   - [ ] Android研究记录
   - [ ] CMake笔记
   - [X] C++学习笔记
   - [ ] Java编程笔记
   - [ ] Unix下C编程学习笔记
   - [X] 内核编程笔记
* Calendar
  :PROPERTIES:
  :CATEGORY: CALENDAR
  :END:
* Financial
  :PROPERTIES:
  :CATEGORY: FINANCIAL
  :END:
** 招商银行信用卡还款提醒
   SCHEDULED: <2016-01-28 周四 +1m -2d>

** 浦发银行信用卡还款提醒
   SCHEDULED: <2016-01-19 周二 +1m -2d>

** 广发银行信用卡还款提醒
   SCHEDULED: <2016-01-30 周六 +1m -2d>

** 还贷提醒
   SCHEDULED: <2016-01-29 周五 +1m -2d>
* Personal Affairs
** 老板电话
   409 886 961 319 931
** 打台湾电话
   409 886 + ...
* Projects
  :PROPERTIES:
  :CATEGORY: PROJECTS
  :END:
** 长虹 [1/1]
** Dajiang [2/2]
** Hisense [1/1]
** TCL [1/1]
** Skyworth
*** 网络拔掉后，Wifi回连时间较长
    0608

*** 项目信息
**** 联系人电话
     18575639260

**** 软件版本信息
     升级前的版本： 5.50.88058-606151-2016/05/26 16:03:59

**** KO路径
     ./system/rtk_rootfs/lib/modules/kernel/wifi/mt7662u_sta.ko

*** RD
    Neil Wu (吳宗軒)
    
** 微鲸

*** 项目信息

    | 项目                          | 说明                                  |
    |-------------------------------+---------------------------------------|
    | 智能电视平台                  | Mstar 6A828/6A938，海思 Kirin 310/510 |
    | 项目规划                      | 2016/Q4 Sample-run                    |
    | 利尔达 的微鯨PM               | 焦绍华  ( jsh@lierda.com )            |
    | 利尔达H/W &生产               | 淡江( danjiang@lierda.com )           |
    | 利尔达S/W                     | 刘新鹏 ( liuxp@lierda.com )           |
    | 微鲸商务                      | 袁寅（yuan.yin@whaley.cn）            |
    | 微鲸硬件                      | 刘立峰（liu.lifeng@whaley.cn）        |
    | 微鲸项目/软件                 | 袁磊（yuan.lei@whaley.cn）            |
    | MTK support Window for Lierda | H/W: Frank                            |
    |-------------------------------+---------------------------------------|
    
** 案例
*** p2p go dhcp failed after wlan0 linkdown
    WCNCR00082921
*** gpiolib
*** kallsyms_lookup_name() //查找对应symbol然后调用
* Daily GTD
  :PROPERTIES:
  :CATEGORY: TASKS
  :END:
** ☛ TODO 数据结构与算法设计学习                                       :Study:
    SCHEDULED: <2016-08-15 一>
    CLOCK: [2016-08-13 六 15:24]--[2016-08-13 六 16:04] =>  0:40
   :PROPERTIES:
   :Effort:   8:00
   :END:
    数据结构与常见算法思想学习
Added: [2016-08-11 周四 13:25]
** ☛ TODO 整理问题集                                                   :Study:
    SCHEDULED: <2016-08-15 一>
   :PROPERTIES:
   :Effort:   8:00
   :END:
将问题集写到个人知识库里面
Added: [2016-08-11 周四 17:15]

** ☛ TODO 设计模式学习                                                 :Study:
    SCHEDULED: <2016-08-15 一>
    CLOCK: [2016-08-13 六 17:01]--[2016-08-13 六 17:24] =>  0:23
    CLOCK: [2016-08-13 六 16:30]--[2016-08-13 六 16:41] =>  0:11
    CLOCK: [2016-08-13 六 16:05]--[2016-08-13 六 16:30] =>  0:25
   :PROPERTIES:
   :Effort:   8:00
   :END:
    设计模式学习
    Added: [2016-08-11 周四 19:15]
